# PinnedFabricationPartNotChangeExtension Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..PinnedFabricationPartNotChangeExtension Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Failed to change extension of part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PinnedFabricationPartNotChangeExtension { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PinnedFabricationPartNotChangeExtension As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PinnedFabricationPartNotChangeExtension {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace